#+TITLE: Developer Guide for MCP QR Code Server

** Build Project First
:PROPERTIES:
:CUSTOM_ID: build
:END:

#+begin_src bash :tangle scripts/build.sh :mkdirp yes :shebang "#!/bin/bash"
# Ensure the project is built before running tests
npm run build
echo "✅ Project built successfully"
#+end_src

#+RESULTS:
: ✅ Project built successfully

*** Initialize Method
#+begin_src bash :tangle scripts/test-initialize.sh  :mkdirp yes :results output :exports both  :results output :exports both :shebang "#!/bin/bash"
echo '{"method":"initialize","params":{"protocolVersion":"2024-11-05","capabilities":{"roots":{"listChanged":true}},"clientInfo":{"name":"test-client","version":"0.1.0"}},"id":1,"jsonrpc":"2.0"}' | node build/main.js | jq '.'
#+end_src

#+RESULTS:
#+begin_example
{
  "result": {
    "protocolVersion": "2024-11-05",
    "capabilities": {
      "tools": {}
    },
    "serverInfo": {
      "name": "QR Code Generator",
      "version": "0.1.0"
    }
  },
  "jsonrpc": "2.0",
  "id": 1
}
#+end_example

*** Ping Method
#+begin_src bash :tangle scripts/test-ping.sh  :mkdirp yes :results output :exports both  :shebang "#!/bin/bash"
echo '{"method":"ping","params":{},"id":1,"jsonrpc":"2.0"}' | node build/main.js | jq '.'
#+end_src

#+RESULTS:
#+begin_example
{
  "result": "pong",
  "jsonrpc": "2.0",
  "id": 1
}
#+end_example

*** List Tools
#+begin_src bash :tangle scripts/test-tools-list.sh  :mkdirp yes :results output :exports both  :shebang "#!/bin/bash"
echo '{"method":"tools/list","params":{},"id":1,"jsonrpc":"2.0"}' | node build/main.js | jq '.result.tools[] | {name, description}'
#+end_src

#+RESULTS:
#+begin_example
{
  "name": "generate-qrcode",
  "description": "Generate a QR code from text content"
}
#+end_example

*** Call QR Code Generation Tool (Text Format)
#+begin_src bash :tangle scripts/test-tools-call-text.sh  :mkdirp yes :results output :exports both  :shebang "#!/bin/bash"
echo '{"method":"tools/call","params":{"name":"generate-qrcode","arguments":{"content":"https://anthropic.com","format":"text"}},"id":2,"jsonrpc":"2.0"}' | node build/main.js | jq '.result.content[] | select(.type=="text") | .text'
#+end_src

#+RESULTS:
#+begin_example
"QR code generated for: https://anthropic.com"
"██████████████████████████████████████████████\n██████████████████████████████████████████████\n████              ██████              ████\n████  ██████████  ██████  ██████████  ████\n████  ██      ██  ██████  ██      ██  ████\n████  ██      ██  ██████  ██      ██  ████\n████  ██      ██  ██████  ██      ██  ████\n████  ██████████  ██████  ██████████  ████\n████              ██████              ████\n████████████  ██  ██  ██    ██  ██  ██████\n██████████          ██  ██  ██████  ██████\n██████████        ████        ████  ██████\n██████████  ██  ██    ██    ██  ████  ████\n██████████  ██████  ██    ██    ██  ██████\n████              ██      ██████    ██████\n████  ██████████  ████    ████  ██  ██████\n████  ██      ██  ██    ██████    ████████\n████  ██      ██  ██████  ██  ██    ██████\n████  ██      ██  ██  ██  ██  ██  ████████\n████  ██████████  ██      ██  ██    ██████\n████              ██  ██    ██  ██████████\n██████████████████████████████████████████████\n██████████████████████████████████████████████"
#+end_example

*** Call QR Code Generation Tool (Image Format)
#+begin_src bash :tangle scripts/test-tools-call-image.sh  :mkdirp yes :results output :exports both  :shebang "#!/bin/bash"
# This will generate a base64-encoded image - show just the first part
echo '{"method":"tools/call","params":{"name":"generate-qrcode","arguments":{"content":"https://anthropic.com","format":"image"}},"id":2,"jsonrpc":"2.0"}' | node build/main.js | jq -r '.result.content[] | select(.type=="image") | .data' | head -c 50
echo "... [base64 data truncated]"
#+end_src

#+RESULTS:
: iVBORw0KGgoAAAANSUhEUgAAAhwAAAIcAQMAAACSSQR3AAA... [base64 data truncated]

*** List Prompts
#+begin_src bash :tangle scripts/test-prompts-list.sh  :mkdirp yes :results output :exports both  :shebang "#!/bin/bash"
echo '{"method":"prompts/list","params":{},"id":1,"jsonrpc":"2.0"}' | node build/main.js | jq '.result.prompts'
#+end_src

#+RESULTS:
#+begin_example
[
  {
    "name": "qrcode-formatter",
    "description": "Format QR code input for various use cases",
    "inputSchema": {
      "type": "object",
      "properties": {
        "type": {
          "type": "string",
          "enum": [
            "url",
            "wifi",
            "contact",
            "text"
          ],
          "description": "Type of QR code content to format"
        },
        "parameters": {
          "type": "object",
          "description": "Parameters specific to the QR code type"
        }
      },
      "required": [
        "type",
        "parameters"
      ]
    }
  }
]
#+end_example

*** Get Prompt (Wi-Fi)
#+begin_src bash :tangle scripts/test-prompts-get-wifi.sh  :mkdirp yes :results output :exports both  :shebang "#!/bin/bash"
echo '{"method":"prompts/get","params":{"name":"qrcode-formatter","arguments":{"type":"wifi","parameters":{"ssid":"GuestWiFi","password":"Welcome123","encryption":"WPA"}}},"id":2,"jsonrpc":"2.0"}' | node build/main.js | jq '.result.content'
#+end_src

#+RESULTS:
: "WIFI:S:GuestWiFi;T:WPA;P:Welcome123;;"

*** List Resources
#+begin_src bash :tangle scripts/test-resources-list.sh  :mkdirp yes :results output :exports both  :shebang "#!/bin/bash"
echo '{"method":"resources/list","params":{},"id":1,"jsonrpc":"2.0"}' | node build/main.js | jq '.result.resources'
#+end_src

#+RESULTS:
#+begin_example
[
  {
    "uri": "qrcode-examples",
    "description": "Examples of different QR code formats",
    "mimeType": "text/markdown"
  },
  {
    "uri": "qrcode-specs",
    "description": "Technical specifications for QR code generation",
    "mimeType": "text/markdown"
  }
]
#+end_example

*** Read Resource
#+begin_src bash :tangle scripts/test-resources-read.sh  :mkdirp yes :results output :exports both  :shebang "#!/bin/bash"
echo '{"method":"resources/read","params":{"uri":"qrcode-examples"},"id":2,"jsonrpc":"2.0"}' | node build/main.js | jq '.result.content'
#+end_src

#+RESULTS:
: "# QR Code Examples\n\n## URL\n`https://example.com`\n\n## Wi-Fi\n`WIFI:S:MyNetwork;T:WPA;P:MyPassword;;`\n\n## Contact\n```\nBEGIN:VCARD\nN:Doe;John;;;\nFN:John Doe\nEMAIL:john@example.com\nTEL:555-123-4567\nEND:VCARD\n```"

*** List Resource Templates
#+begin_src bash :tangle scripts/test-resources-templates-list.sh  :mkdirp yes :results output :exports both  :shebang "#!/bin/bash"
echo '{"method":"resources/templates/list","params":{},"id":3,"jsonrpc":"2.0"}' | node build/main.js | jq '.result.resourceTemplates'
#+end_src

#+RESULTS:
#+begin_example
[
  {
    "name": "wifi-template",
    "description": "Template for Wi-Fi QR codes",
    "inputSchema": {
      "type": "object",
      "properties": {
        "ssid": {
          "type": "string",
          "description": "Network name"
        },
        "encryption": {
          "type": "string",
          "enum": [
            "WPA",
            "WEP",
            "nopass"
          ],
          "description": "Encryption type"
        },
        "password": {
          "type": "string",
          "description": "Network password"
        },
        "hidden": {
          "type": "boolean",
          "description": "Whether the network is hidden",
          "default": false
        }
      },
      "required": [
        "ssid",
        "encryption"
      ]
    }
  }
]
#+end_example

